 {
    "number": "15",
    "title": "Prohibition of discrimination on grounds of religion, race, caste, sex or place of birth",
    "text": "<ul><li>(1) The State shall not discriminate against any citizen on grounds only of religion, race, caste, sex, place of birth or any of them.</li><br><li>(2) No citizen shall, on grounds only of religion, race, caste, sex, place of birth or any of them, be subject to any disability, liability, restriction or condition with regard to <ul><li>(a) access to shops, public restaurants, hotels and places of public entertainment; or</li><li>(b) the use of wells, tanks, bathing ghats, roads and places of public resort maintained wholly or partly out of State funds or dedicated to the use of the general public.</li></ul></li><br><li>(3) Nothing in this article shall prevent the State from making any special provision for women and children.</li><br><li><sup>1</sup>[(4) Nothing in this article or in clause (2) of article 29 shall prevent the State from making any special provision for the advancement of any socially and educationally backward classes of citizens or for the Scheduled Castes and the Scheduled Tribes.]</li><br><li><sup>93</sup>[(5) Nothing in this article or in sub-clause (g) of clause (1) of article 19 shall prevent the State from making any special provision, by law, for the advancement of any socially and educationally backward classes of citizens or for the Scheduled Castes or the Scheduled Tribes in so far as such special provisions relate to their admission to educational institutions including private educational institutions, whether aided or unaided by the State, other than the minority educational institutions referred to in clause (1) of article 30.]</li><br><li><sup>103</sup>[(6) Nothing in this article or sub-clause (g) of clause (1) of article 19 or clause (2) of article 29 shall prevent the State from making,—<ul><li>(a) any special provision for the advancement of any economically weaker sections of citizens other than the classes mentioned in clauses (4) and (5); and</li><li>(b) any special provision for the advancement of any economically weaker sections of citizens other than the classes mentioned in clauses (4) and (5) in so far as such special provisions relate to their admission to educational institutions including private educational institutions, whether aided or unaided by the State, other than the minority educational institutions referred to in clause (1) of article 30, which in the case of reservation would be in addition to the existing reservations and subject to a maximum of ten per cent. of the total seats in each category.</li></ul><br>Explanation.—For the purposes of this article and article 16, 'economically weaker sections' shall be such as may be notified by the State from time to time on the basis of family income and other indicators of economic disadvantage.]</li></ul>",
    "summary": "",
    "amendments": [
      {
        "year": "1st CAA, 1951",
        "description": "Inserted Art 15(4), which expressly permits State to make 'any special provision' for adv. of any SEBCs/SCs/STs. It also protects such provisions from challenge under Art 15 or Art 29(2) (No citizen to be denied admission to EI maintained by State or receiving aid from State on grounds only of religion, race, caste, language).<br>This clause was added to remove difficulties in making provisions in pursuance of the directive given in Art 46 (Promotion of educational & economic interests of SCs,STs, other weaker sections) and to remove difficulties.<br><ul><li>In the State of Madras v. Champakram Dorairajan Case, 1951, it was held that State of Madras' policy of reserving seats in medical colleges was violative of Art 15(1) of the Indian Constitution.</ul>"
      },
      {
        "year": "93rd CAA, 2005",
        "description": "Inserted Art 15(5), which expressly permits State to make any special provision, by law, for adv. of any SEBC/SC/ST wrt admission into EIs, incld Pvt EIs, whether aided or unaided but NOT MEIs u. Art 30(1) (All minorities, religious or linguistic, shall have right to estb & admin EIs.).<br><ul><li>In the TMA Pai v. State of KN Case, 2002, the Hon'ble SC recognised the autonomy of Pvt, unaided EIs and stated that unaided MEIs cannot be forced to give reservations.<br></li><li>In the PA Inamdar Case, 2005, it was further clarified that State cannot impose reservation policy on either unaided MEIs or private EIs.</li><li> The 93rd CAA was enacted in context of the 2005 judgement to allow reservation in even Private unaided EIs, while respecting the Constitutional protection given to MEIs under Art 30(1).</li></ul>"
      },
      {
        "year": "103rd CAA, 2019",
        "description": "Inserted Art 15(6), which expressly permits State to make provisions for any EWS (other than SEBCs/SCs/STs) in same manner as Art 15(4) and Art 15(5) makes for SEBCs/SCs/STs. 'EWS' are notified by State on basis of 'family income & other indicators of economic disadvantage'<br><ul><li>In the Janhit Abhiyan v UoI, 2022, SC upheld the 103rd CAA, 2019.</li></ul>"
      }
    ]
  }  
