 {
    "number": "16",
    "title": "Equality of opportunity in matters of public employment",
    "text": "<ul><li>(1) There shall be equality of opportunity for all citizens in matters relating to employment or appointment to any office under the State.</li><br><li>(2) No citizen shall, on grounds only of religion, race, caste, sex, descent, place of birth, residence or any of them, be ineligible for, or discriminated against in respect of, any employment or office under the State.</li><br><li>(3) Nothing in this article shall prevent Parliament from making any law prescribing, in regard to a class or classes of employment or appointment to an office <sup>7</sup>[under the Government of, or any local or other authority within, a State or Union territory, any requirement as to residence within that State or Union territory] prior to such employment or appointment.</li><br><li>(4) Nothing in this article shall prevent the State from making any provision for the reservation of appointments or posts in favour of any backward class of citizens which, in the opinion of the State, is not adequately represented in the services under the State.</li><li><br><sup>77</sup>[(4A) Nothing in this article shall prevent the State from making any provision for reservation <sup>85</sup>[in matters of promotion, with consequential seniority, to any class] or classes of posts in the services under the State in favour of the Scheduled Castes and the Scheduled Tribes which, in the opinion of the State, are not adequately represented in the services under the State.]</li><br><li><sup>81</sup>[(4B) Nothing in this article shall prevent the State from considering any unfilled vacancies of a year which are reserved for being filled up in that year in accordance with any provision for reservation made under clause (4) or clause (4A) as a separate class of vacancies to be filled up in any succeeding year or years and such class of vacancies shall not be considered together with the vacancies of the year in which they are being filled up for determining the ceiling of fifty per cent. reservation on total number of vacancies of that year.]</li><br><li>(5) Nothing in this article shall affect the operation of any law which provides that the incumbent of an office in connection with the affairs of any religious or denominational institution or any member of the governing body thereof shall be a person professing a particular religion or belonging to a particular denomination.</li><br><li><sup>103</sup>[(6) Nothing in this article shall prevent the State from making any provision for the reservation of appointments or posts in favour of any economically weaker sections of citizens other than the classes mentioned in clause (4), in addition to the existing reservation and subject to a maximum of ten per cent. of the posts in each category.]</li></ul>",
    "summary": "<ul> <li>16(1): Eq Opp for ‘all citizens’ in &#39;public emp u. State’</li> <li>16(2): No ctzn to be discrm. on grnds of rr-cs-dbra (‘religion, race, caste, sex, descent, birth, residence or any’)</li> <li>16(3): Parl (only) may, by law, req. residence as criteria for emp. u. State</li><ul><li> SC thus struck down domicile-based rsrvns made by States like AP etc</li> </ul><li>16(4) contains enabling provisions for Reservations in posts for &#39;any backward class&#39; not adeq. rprsn. Note that this Article has existed since commencement of Const..</li> <li>Indra Sawhney Case 1992: Max 50% limit for rsrvn. No rsrvn in promotions<ul> <li>In 1995, Parl passed the 77th, 1995, allowing the same.</li> </ul> </li> <li>UoI v. Virpal Singh Chauhan (1995) and Ajit Singh v. State of PJ (1999): held that Reservation in promotion did not entail consequential seniority.<ul> <li>In the next couple of years, Parl passed 81st, 2000 (unfilled vac.s sep. class in 4B) and 85th, 2001 (conseq. seniority in 4A)</li> </ul> </li> <li>16(5) Art 16 to not affect any law req. incumbent of religious office to be m. of that relig./domination</li> <li>16(6) Reservation in posts for EWS, o. than those covered u. 16(4). Max limit of 10% on top of existing rsrvn</li> </ul> ",
    "amendments": [
      {
        "year": "7th, 1956",
        "description": "verbiage change for State/UT"
      },
      {
        "year": "77th, 1995",
        "description": "inserted 16(4A) → reservation in promotions (in posts/svcs of State) for SC/STs"
      },
      {
        "year": "81st, 2000",
        "description": "inserted 16(4B) → unfilled vacancies to of preceding years as separate class than those of this year"
      },
      {
        "year": "85th, 2001",
        "description": "amended 4(A) → reservation in promotion w. consequential seniority"
      },
      {
        "year":"103rd, 2019",
        "description":"inserted 16(6) → EWS Rsrvn, 10% on top of existing"
      }
    ]
  }  
