{
    "number": "1",
    "title": "Name and Territory of Union",
    "text": "<ul><li>  (1) India, that is Bharat, shall be a Union of States.</li><li><sup>7</sup>[(2) The States and the territories thereof shall be as specified in the First Schedule.]<li>  (3) The territory of India shall comprise—  <ul><li>(a) the territories of the States;</li> <li><sup>7</sup>[(b) the Union territories specified in the First Schedule; and]</li>  <li>(c) such other territories as may be acquired.</li></ul>",
    "summary": "Art 1(1) describes India as a 'Union of States', despite it being federal in structure. Dr BR Ambedkar justified this terminology by stating that the Indian Federation was was not the result of an agreement among the States (unlike the USA), and to emphasise that State did not have a right to secede (like the USA post Civil War 1861).<br><br> Art 1(3) connotes that the term 'Territory of India' is wider than 'Union of India' as it also includes any 'acquired territories'.<br><div class='Extra'>Extra — Comparison with USA:<ul><li> During the American Revolution (1775-1783), the Articles of Confederation (1777) were signed as an agreement b.w the original 13 colonies. This estb the US Confederation as a political entity and provided for a 'Perpetual Union'. The Federal Govt, was consciously kept weaker. The Articles were later replaced by US Const of 1789, which began with the words 'WE THE PEOPLE' but omitted the 'Perpetual Union' clause.</li><li> Later, 11 Southern states waged a Civil War (1861-65) over a variety of issue, particularly State Autonomy, Slavery and the right to secede from the Union. The war, resolved u. leadership of Abraham Lincoln, ultimately estb that individual states had no constitutional right to secede.</li><li> This principle was later reinforced via SCOTUS' Texas v. White Case, 1869.</li><li>Dr BRA, therefore, used the term 'Union of States' in Art 1 to remove possibility of doubts or conflicts that may arise in the future.</ul>",
    "amendments": [
      {
        "year": "7th CAA, 1956",
        "description": "verbiage changed for new State-UT scheme"
      }
    ]
  }
  
