{
    "number": "3",
    "title": "Formation of new States and alteration of areas, boundaries or names of existing States.",
    "text": "<p>Parliament may by law—</p><ul><li>(a) form a new State by separation of territory from any State or by uniting two or more States or parts of States or by uniting any territory to a part of any State;</li><li>(b) increase the area of any State;</li><li>(c) diminish the area of any State;</li><li>(d) alter the boundaries of any State;</li><li>(e) alter the name of any State:</li></ul><p><sup>x</sup>[Provided that no Bill for the purpose shall be introduced in either House of Parliament except on the recommendation of the President and unless, where the proposal contained in the Bill affects the area, boundaries or name of any of the States<sup>y</sup>***, the Bill has been referred by the President to the Legislature of that State for expressing its views thereon within such period as may be specified in the reference or within such further period as the President may allow and the period so specified or allowed has expired.]</p><p><sup>18</sup>[Explanation I.—In this article, in clauses (a) to (e), “State” includes a Union territory, but in the proviso, “State” does not include a Union territory. Explanation II.—The power conferred on Parliament by clause (a) includes the power to form a new State or Union territory by uniting a part of any State or Union territory to any other State or Union territory.]</p>",
    "summary": "Recommendation of President is required for introduction of any Bill under Article 3. <br>Moreover, when said Bill provides for alteration of area, boundaries of names of States, it must be referred to State Legis for expressing its views within a period that President decides and which President may extend. <br>This requirement (as to reference for expressing views) is not required in case of UTs, since they are directly under the Union.",
    "amendments": [
      {
        "year": "18th CAA, 1966",
        "description": "Explanation added to clarify that requirement regarding reference for expressing views is not required in case of UTs. Also emphasises the extansive nature of Parliament power to rejig State attributes under Article 3"
      }
    ]
  }
  